feat: update docs to use mermaid (#152)
